In [15]:
import pandas as pd
import numpy as np

#### 1. Write a Pandas program to get the powers of an array values element-wise.

In [16]:
dataset = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [18]:
dataset.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

#### 2.Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [41]:
dataset_1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [42]:
dataset_1.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data

In [45]:
dataset_2 = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [46]:
dataset_lab = pd.DataFrame(dataset_2,labels)

In [47]:
dataset_lab.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [55]:
dataset_lab.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 4. Write a Pandas program to get the first 3 rows of a given DataFrame

In [59]:
dataset_lab.head(3)  # first option
dataset_lab.iloc[:3] # second options

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

#### 5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame

In [78]:
dataset_lab[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

#### 6. Write a Pandas program to select the specified columns and rows from a given data frame.

In [111]:
data_out = pd.DataFrame(dataset_lab, columns = ['score','qualify'], index = list('bdfg'))
data_out.head(10)

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [131]:
data_out_2 = pd.DataFrame(dataset_lab).iloc[[1,3,5,6],[1,3]]
data_out_2.head(10)

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

#### 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [141]:
dataset_3 = dataset_lab[dataset_lab['attempts']>2]
dataset_3.head()

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [152]:
dataset_4 = dataset_lab[dataset_lab['score'] == 9]
dataset_4.head(10)

    name  score  attempts qualify
b   Dima    9.0         3      no
e  Emily    9.0         2      no

#### 8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [156]:
dataset_lab.shape

(10, 4)

In [171]:
rows = len(dataset_lab.axes[0])
columns = len(dataset_lab.axes[1])

In [172]:
print(f"Number of Rows: {rows} \nNumber of Columns: {columns}")

Number of Rows: 10
Number of Columns: 4

#### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [183]:
miss_data = dataset_lab[dataset_lab['score'].isnull()]

In [184]:
miss_data.head(10)

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

#### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [194]:
nonan_data = dataset_lab[dataset_lab['score'].between(15, 20)]

In [196]:
nonan_data.head(10)

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

#### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [209]:
compare_data = dataset_lab[(dataset_lab['attempts']<2) & (dataset_lab['score']>15)]

In [210]:
compare_data.head(10)

    name  score  attempts qualify
j  Jonas   19.0         1     yes

#### 12. Write a Pandas program to change the score in row 'd' to 11.5

In [250]:
dataset_2 = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataset_5 = pd.DataFrame(dataset_2,index=labels)

In [261]:
dataset_5.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [266]:
change_data = dataset_5.loc['d', 'score'] = 11.5

In [269]:
dataset_5.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [270]:
change_data_1 = dataset_5.loc['h', 'score'] = 11.5

In [271]:
dataset_5.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   11.5         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 13. Write a Pandas program to calculate the sum of the examination attempts by the students

In [283]:
sum_data = dataset_5['attempts'].sum()

In [286]:
print(f"Sum of the examination attempts by the students: {sum_data}")

Sum of the examination attempts by the students: 19